dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/src/stm32f2xx_nvic_1208.c
/*******************************************************************************
* Function Name  : NVIC_GetIRQChannelActiveBitStatus
* Description    : Checks whether the specified IRQ Channel active bit is set
*                  or not.
* Input          : - NVIC_IRQChannel: specifies the interrupt active bit to check.
* Output         : None
* Return         : The new state of IRQ Channel active bit(SET or RESET).
*******************************************************************************/
INT32U NVIC_GetIRQChannelActiveBitStatus(u8 NVIC_IRQChannel)
{
    INT32U activeirqstatus = RESET;
    u32 tmp = 0x00;

    /* Check the parameters */
    assert(IS_NVIC_IRQ_CHANNEL(NVIC_IRQChannel));
  
    tmp = ((u32)0x01 << (NVIC_IRQChannel & (u32)0x1F));

    if (((NVIC->IABR[(NVIC_IRQChannel >> 0x05)]) & tmp) == tmp )
    {
        activeirqstatus = SET;
    }
    else
    {
        activeirqstatus = RESET;
    }
    return activeirqstatus;
}

/*******************************************************************************
* Function Name  : NVIC_GetCPUID
* Description    : Returns the ID number, the version number and the implementation
*                  details of the Cortex-M3 core.
* Input          : None
* Output         : None
* Return         : CPU ID.
*******************************************************************************/
u32 NVIC_GetCPUID(void)
{
	return (SCB->CPUID);
}


/*******************************************************************************
  * @brief  Sets the vector table location and Offset.
  * @param  NVIC_VectTab: specifies if the vector table is in RAM or FLASH memory.
  *   This parameter can be one of the following values:
  *     @arg NVIC_VectTab_RAM: Vector Table in internal SRAM.
  *     @arg NVIC_VectTab_FLASH: Vector Table in internal FLASH.
  * @param  Offset: Vector Table base offset field. This value must be a multiple of 0x200.
  * @retval None
  *****************************************************************************/
void NVIC_SetVectorTable(u32 Addr)
{
	SCB->VTOR = Addr & 0x3FFFFF80;
}

/*******************************************************************************
  * @brief	Selects the condition for the system to enter low power mode.
  * @param	LowPowerMode: Specifies the new mode for the system to enter low power mode.
  *   This parameter can be one of the following values:
  * 	@arg NVIC_LP_SEVONPEND: Low Power SEV on Pend.
  * 	@arg NVIC_LP_SLEEPDEEP: Low Power DEEPSLEEP request.
  * 	@arg NVIC_LP_SLEEPONEXIT: Low Power Sleep on Exit.
  * @param	NewState: new state of LP condition. This parameter can be: ENABLE or DISABLE.
  * @retval None
  *******************************************************************************/
void NVIC_SystemLPConfig(u8 LowPowerMode, INT32U NewState)
{
	/* Check the parameters */
	assert(IS_NVIC_LP(LowPowerMode));
	assert(IS_FUNCTIONAL_STATE(NewState));  

	if (NewState != DISABLE)
	{
		SCB->SCR |= LowPowerMode;
	}
	else
	{
		SCB->SCR &= (u32)(~(u32)LowPowerMode);
	}
}

/*******************************************************************************
* Function Name  : NVIC_SystemHandlerConfig
* Description    : Enables or disables the specified System Handlers.
* Input          : - SystemHandler: specifies the system handler to be enabled
*                    or disabled.
*                    This parameter can be one of the following values:
*                       - SystemHandler_MemoryManage
*                       - SystemHandler_BusFault
*                       - SystemHandler_UsageFault
*                  - NewState: new state of  specified System Handlers.
*                    This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void NVIC_SystemHandlerConfig(u32 SystemHandler, INT32U NewState)
{
	u32 tmpreg = 0x00;

	/* Check the parameters */
	assert(IS_CONFIG_SYSTEM_HANDLER(SystemHandler));
	assert(IS_FUNCTIONAL_STATE(NewState)); 

	tmpreg =  (u32)0x01 << (SystemHandler & (u32)0x1F);

	if (NewState != DISABLE)
	{
		SCB->SHCSR |= tmpreg;
	}
	else
	{
		SCB->SHCSR &= ~tmpreg;
	}
}

/*******************************************************************************
* Function Name  : NVIC_SystemHandlerPriorityConfig
* Description    : Configures the specified System Handlers priority.
* Input          : - SystemHandler: specifies the system handler to be
*                    enabled or disabled.
*                    This parameter can be one of the following values:
*                       - SystemHandler_MemoryManage
*                       - SystemHandler_BusFault
*                       - SystemHandler_UsageFault
*                       - SystemHandler_SVCall
*                       - SystemHandler_DebugMonitor
*                       - SystemHandler_PSV
*                       - SystemHandler_SysTick
*                  - SystemHandlerPreemptionPriority: new priority group of the
*                    specified system handlers.
*                  - SystemHandlerSubPriority: new sub priority of the specified
*                    system handlers.
* Output         : None
* Return         : None
*******************************************************************************/
void NVIC_SystemHandlerPriorityConfig(u32 SystemHandler, u8 SystemHandlerPreemptionPriority,
                                      u8 SystemHandlerSubPriority)
{
  u32 tmp1 = 0x00, tmp2 = 0xFF, handlermask = 0x00;
  u32 tmppriority = 0x00;

  /* Check the parameters */
  assert(IS_PRIORITY_SYSTEM_HANDLER(SystemHandler));	//	SystemHandler_SysTick 0x02C39A
  assert(IS_NVIC_PREEMPTION_PRIORITY(SystemHandlerPreemptionPriority));  
  assert(IS_NVIC_SUB_PRIORITY(SystemHandlerSubPriority));
    
  tmppriority = (0x700 - (SCB->AIRCR & (u32)0x700))>> 0x08;
  tmp1 = (0x4 - tmppriority);
  tmp2 = tmp2 >> tmppriority;
    
  tmppriority = (u32)SystemHandlerPreemptionPriority << tmp1;
  tmppriority |=  SystemHandlerSubPriority & tmp2;

  tmppriority = tmppriority << 0x04;
  tmp1 = SystemHandler & (u32)0xC0;
  tmp1 = tmp1 >> 0x06; 
  tmp2 = (SystemHandler >> 0x08) & (u32)0x03;
  tmppriority = tmppriority << (tmp2 * 0x08);
  handlermask = (u32)0xFF << (tmp2 * 0x08);
  
  SCB->__B.SHP[tmp1] &= ~handlermask;
  SCB->__B.SHP[tmp1] |= tmppriority;
}

