dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/src/stm32f2xx_nvic_1208.c
/*******************************************************************************
* Function Name  : NVIC_GetSystemHandlerPendingBitStatus
* Description    : Checks whether the specified System handlers pending bit is
*                  set or not.
* Input          : - SystemHandler: specifies the system handler pending bit to
*                    check.
*                    This parameter can be one of the following values:
*                       - SystemHandler_MemoryManage
*                       - SystemHandler_BusFault
*                       - SystemHandler_SVCall
* Output         : None
* Return         : The new state of System Handler pending bit(SET or RESET).
*******************************************************************************/
INT32U NVIC_GetSystemHandlerPendingBitStatus(u32 SystemHandler)
{
	INT32U bitstatus  = RESET;
	u32 tmp = 0x00, tmppos = 0x00;

	/* Check the parameters */
	assert(IS_GET_PENDING_SYSTEM_HANDLER(SystemHandler));

	tmppos = (SystemHandler >> 0x0A);
	tmppos &= (u32)0x0F;

	tmppos = (u32)0x01 << tmppos;

	tmp = SCB->SHCSR & tmppos;

	if (tmp == tmppos)
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	return bitstatus;
}

/*******************************************************************************
* Function Name  : NVIC_SetSystemHandlerPendingBit
* Description    : Sets System Handler pending bit.
* Input          : - SystemHandler: specifies the system handler pending bit
*                    to be set.
*                    This parameter can be one of the following values:
*                       - SystemHandler_NMI
*                       - SystemHandler_PSV
*                       - SystemHandler_SysTick
* Output         : None
* Return         : None
*******************************************************************************/
void NVIC_SetSystemHandlerPendingBit(u32 SystemHandler)
{
	u32 tmp = 0x00;

	/* Check the parameters */
	assert(IS_SET_PENDING_SYSTEM_HANDLER(SystemHandler));

	/* Get the System Handler pending bit position */
	tmp = SystemHandler & (u32)0x1F;
	/* Set the corresponding System Handler pending bit */
	SCB->ICSR |= ((u32)0x01 << tmp);
}

/*******************************************************************************
* Function Name  : NVIC_ClearSystemHandlerPendingBit
* Description    : Clears System Handler pending bit.
* Input          : - SystemHandler: specifies the system handler pending bit to
*                    be clear.
*                    This parameter can be one of the following values:
*                       - SystemHandler_PSV
*                       - SystemHandler_SysTick
* Output         : None
* Return         : None
*******************************************************************************/
void NVIC_ClearSystemHandlerPendingBit(u32 SystemHandler)
{
	u32 tmp = 0x00;

	/* Check the parameters */
	assert(IS_CLEAR_SYSTEM_HANDLER(SystemHandler));

	/* Get the System Handler pending bit position */
	tmp = SystemHandler & (u32)0x1F;
	/* Clear the corresponding System Handler pending bit */
	SCB->ICSR |= ((u32)0x01 << (tmp - 0x01));
}

/*******************************************************************************
* Function Name  : NVIC_GetSystemHandlerActiveBitStatus
* Description    : Checks whether the specified System handlers active bit is
*                  set or not.
* Input          : - SystemHandler: specifies the system handler active bit to
*                    check.
*                    This parameter can be one of the following values:
*                       - SystemHandler_MemoryManage
*                       - SystemHandler_BusFault
*                       - SystemHandler_UsageFault
*                       - SystemHandler_SVCall
*                       - SystemHandler_DebugMonitor
*                       - SystemHandler_PSV
*                       - SystemHandler_SysTick
* Output         : None
* Return         : The new state of System Handler active bit(SET or RESET).
*******************************************************************************/
INT32U NVIC_GetSystemHandlerActiveBitStatus(u32 SystemHandler)
{
	INT32U bitstatus  = RESET;

	u32 tmp = 0x00, tmppos = 0x00;

	/* Check the parameters */
	assert(IS_GET_ACTIVE_SYSTEM_HANDLER(SystemHandler));

	tmppos = (SystemHandler >> 0x0E) & (u32)0x0F;

	tmppos = (u32)0x01 << tmppos;

	tmp = SCB->SHCSR & tmppos;

	if (tmp == tmppos)
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	return bitstatus;
}

/*******************************************************************************
* Function Name  : NVIC_GetFaultHandlerSources
* Description    : Returns the system fault handlers sources.
* Input          : - SystemHandler: specifies the system handler to get its fault
*                    sources.
*                    This parameter can be one of the following values:
*                       - SystemHandler_HardFault
*                       - SystemHandler_MemoryManage
*                       - SystemHandler_BusFault
*                       - SystemHandler_UsageFault
*                       - SystemHandler_DebugMonitor
* Output         : None
* Return         : Source of the fault handler.
*******************************************************************************/
u32 NVIC_GetFaultHandlerSources(u32 SystemHandler)
{
	u32 faultsources = 0x00;
	u32 tmpreg = 0x00, tmppos = 0x00;

	/* Check the parameters */
	assert(IS_FAULT_SOURCE_SYSTEM_HANDLER(SystemHandler));

	tmpreg = (SystemHandler >> 0x12) & (u32)0x03;
	tmppos = (SystemHandler >> 0x14) & (u32)0x03;

	if (tmpreg == 0x00)
	{
		faultsources = SCB->HFSR;
	}
	else if (tmpreg == 0x01)
	{
		faultsources = SCB->CFSR >> (tmppos * 0x08);
		if (tmppos != 0x02)
		{
	  		faultsources &= (u32)0x0F;
		}
		else
		{
	  		faultsources &= (u32)0xFF;
		}
	}
	else
	{
		faultsources = SCB->DFSR;
	}
	return faultsources;
}

/*******************************************************************************
* Function Name  : NVIC_GetFaultAddress
* Description    : Returns the address of the location that generated a fault
*                  handler.
* Input          : - SystemHandler: specifies the system handler to get its
*                    fault address.
*                    This parameter can be one of the following values:
*                       - SystemHandler_MemoryManage
*                       - SystemHandler_BusFault
* Output         : None
* Return         : Fault address.
*******************************************************************************/
u32 NVIC_GetFaultAddress(u32 SystemHandler)
{
	u32 faultaddress = 0x00;
	u32 tmp = 0x00;

	/* Check the parameters */
	assert(IS_FAULT_ADDRESS_SYSTEM_HANDLER(SystemHandler));

	tmp = (SystemHandler >> 0x16) & (u32)0x01;

	if (tmp == 0x00)
	{
		faultaddress = SCB->MMFAR;
	}
	else
	{
		faultaddress = SCB->BFAR;
	}
	return faultaddress;
}

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
